<a href="https://colab.research.google.com/github/ATechievision/DataHubArchana/blob/main/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas
It is a library which is used for data manipulation.

1. Panel Data
2. Python Data Analysis

# Data types
1. Series: It is 1-d labelled data that will store data of same or different data type.
2. Data Frame: It is a 2-d labelled that will store data in rows and columns.

In [4]:
import pandas as pd

 #How to create a series data that will store my labelled data in a 1-d format.
data= [11,12,'apple',8,'12.34','banana']
s1=pd.Series(data)
s1

0        11
1        12
2     apple
3         8
4     12.34
5    banana
dtype: object

In [6]:
data=[11,12,23,8,55.55]
s1=pd.Series(data)
s1

0    11.00
1    12.00
2    23.00
3     8.00
4    55.55
dtype: float64

In [7]:
data=[11,12,23,8,55]
s1=pd.Series(data)
s1

0    11
1    12
2    23
3     8
4    55
dtype: int64

In [8]:
print(type(data))

<class 'list'>

In [14]:
#How to remove this dtype.
data=[11,12,23,8,55,'banana','55,55']
s1=pd.Series(data)

print(s1.to_string(dtype=False))#s1.to_string(dtype=False) # to_string(dtype=False)---> this will remove dtype

#print(s1.to_string(dtype=True))-doesn't remove the dtype

0        11
1        12
2        23
3         8
4        55
5    banana
6     55,55
dtype: object

In [15]:
data=[11,12,23,8,55,'banana','55,55','apple']
s1=pd.Series(data)
print(s1.to_string(index=False)) #to_string(index=False) -->this will remove my indexes.

    11
    12
    23
     8
    55
banana
 55,55
 apple

# How to add my own labes in place of default labels.

In [18]:
data=[11,12,55,'banana','55,55','apple']
s1=pd.Series(data, index=['first','second','third','fourth','fifth','sixth'])
s1

first         11
second        12
third         55
fourth    banana
fifth      55,55
sixth      apple
dtype: object

# How to access the values in the series by using indexes operation.

In [23]:
data=[11,12,55,'banana','55,55','apple']
s1=pd.Series(data)
s1
#print(s1.to_string(index=False))

0        11
1        12
2        55
3    banana
4     55,55
5     apple
dtype: object

In [21]:
# I want to access the values present at the index 4

print(s1[4])

print(s1[0])

55,55
11

# Can we use some other data type to create as series

In [24]:
# create a series with list
data=[11,12,55,'banana','55,55','apple']
s1=pd.Series(data)
s1

0        11
1        12
2        55
3    banana
4     55,55
5     apple
dtype: object

In [25]:
# create a series with tuple
data=(11,12,55,'banana','55,55','apple')
s1=pd.Series(data)
s1

0        11
1        12
2        55
3    banana
4     55,55
5     apple
dtype: object

In [26]:
# set are unordered -> not ideal for series directly.

#Convert them to a list or tuple_>pd.Series(list(data))
# create a series with set-->list
data={11,12,55,'banana','55,55','apple'}
s1=pd.Series(list(data))
s1=pd.Series(tuple(data))
s1

0    banana
1     55,55
2        55
3        11
4        12
5     apple
dtype: object

In [29]:
# create a series with dictionary(key will act as label)

data={'name' : 'python' , 'DOB' : 1991}
s1= pd.Series(data)
s1

name    python
DOB       1991
dtype: object

# Slicing operation in series

# Extra points to remember: -Series is 1-D --> only one feature --> only one column

In [30]:
data=[11,12,15,19,678,'Mango','Banana','xyz']
s1=pd.Series(data)
s1

0        11
1        12
2        15
3        19
4       678
5     Mango
6    Banana
7       xyz
dtype: object

In [32]:
#i want to access from 12 to 19

print(s1[1:4])

1    12
2    15
3    19
dtype: object

In [37]:
data=[11,12,15,19,678,'Mango','Banana','xyz']
s1=pd.Series(data,index=['first','second','third','fourth','fifth','d','e','f'])
print(s1)

first         11
second        12
third         15
fourth        19
fifth        678
d          Mango
e         Banana
f            xyz
dtype: object

In [38]:
print(s1['second':'d'])

second       12
third        15
fourth       19
fifth       678
d         Mango
dtype: object

In [44]:
s1=pd.Series ([10,20,30])
s2=pd.Series ([40,50])
new=pd.concat([s1,s2],ignore_index=True)
new
#print(new)

0    10
1    20
2    30
3    40
4    50
dtype: int64

# Data Frame

# in dictionary key will acts as columns name here.

In [46]:
data={'Name' : ['a','b','c','d','e','f'], 'Age' : [11,12,13,14,15,16]}
x=pd.DataFrame(data)
x

  Name  Age
0    a   11
1    b   12
2    c   13
3    d   14
4    e   15
5    f   16

In [47]:
data=[['apple','banana','cherry'],['x','y','z']]
x=pd.DataFrame(data)
x

       0       1       2
0  apple  banana  cherry
1      x       y       z

# How to import the data from excel file to python

In [ ]:
data=pd.read_csv('') #this will show top5 and bottom 5 by default

# How to print top any number of records

In [ ]:
data.head(10) # this will show  the top 10

# How to print bottom specific number of record

In [ ]:

data.tail(20) # this will show you the bottom 20

## How to print the full data, all rows and columns(will not show in tabular format)

In [ ]:
print(data.to_string) #this will show you complete data set

## How to perform indexing operstion on data set.

In [ ]:
# for indexing and slicing in dataframe ,you will be using pre-defined functions and that are --->loc and iloc

# loc()
- row /columns labels(names)
- df.loc[1:4]--->this include rows with index 4
- df.loc{ : , 'col1':'col2']--.use column names,while I'am taking column name it will go till end.

In [ ]:
data.loc[0:10] # start,end

In [ ]:
# i want only a specific columns (e.g-hp column to brand column ) want to print values for  5th row

data.loc[5,'hp' : 'brand']# it will print 5th row and column

# in that case the row will become the column

# iloc()---it will take index values for operation , rows, columns-->start , end+1
- row/columns index will be there
- df.iloc[1:4]--> exclude row with index 4
- df.iloc[: ,0:3]--> use column indexes
- df.iloc[1:4, 0:3]--> it excludes column at index 3.
- When we are dealing with positions .

In [ ]:
# I want to access the records  from the start at the index 5.

data.iloc[0:6]

In [ ]:
# i want to perform slicing operations from row 5 to row 10 and columns from mpg to  hp

data.iloc[5:11, 0:4]

In [ ]:
# i want to print all data of row 1,3, 5 and 7(specific rows)-->slicing operation in rows
data.iloc[1:8:2]# start index and end index+1 :step size(which is 2 here(1,3,5,7))

In [ ]:
# access all the data where brand is 'US'
data.iloc[data['brand']=='US.']

In [ ]:
#access all the data where mpg is more than 22

data[data['mpg']] >22

In [ ]:
# access all data where year is 1994 and cylinder are more than 4

data[(data[ear]==1980) & (data['cylinder']>4)]

# Give a sample list ,tuple and a set with elements as number from 1-10.Convert each of the panda types into a pandasseries .Create separate list of inex values for the series.

In [1]:
# prompt: Give a sample list ,tuple and a set with elements as number from 1-10.Convert each of the panda types into a pandasseries .Create separate list of inex values for the series.

import pandas as pd

# Sample list, tuple, and set with elements 1-10
my_list = list(range(1, 11))
my_tuple = tuple(range(1, 11))
my_set = set(range(1, 11))

# Convert to pandas Series
series_from_list = pd.Series(my_list)
series_from_tuple = pd.Series(my_tuple)
series_from_set = pd.Series(list(my_set)) # Sets are unordered, so convert to a list first

# Create separate lists of index values
index_list = list(range(len(my_list)))
index_tuple = list(range(len(my_tuple)))
index_set = list(range(len(my_set)))

# Print the series and indexes (optional)
print("Series from list:\n", series_from_list)
print("Index for list:\n", index_list)

print("\nSeries from tuple:\n", series_from_tuple)
print("Index for tuple:\n", index_tuple)

print("\nSeries from set:\n", series_from_set)
print("Index for set:\n", index_set)

Series from list:
 0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64
Index for list:
 [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

Series from tuple:
 0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64
Index for tuple:
 [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

Series from set:
 0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64
Index for set:
 [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [4]:
import pandas as pd

my_list=[11,12,15,19,678,'Mango','Banana','xyz']
my_tuple=(1,2,3,4,5,6,7,8,9)
my_set={1,2,3,4,5,6,7,8,9}
s1=pd.Series(my_list,index=['first','second','third','fourth','fifth','d','e','f'])
print(s1)
s2=pd.Series(my_tuple,index=['a','b','c','d','e','f','g','h','i'])
print(s2)
s3=pd.Series(my_set,index=['a','b','c','d','e','f','g','h','i'])
print(s3)

first         11
second        12
third         15
fourth        19
fifth        678
d          Mango
e         Banana
f            xyz
dtype: object
a    1
b    2
c    3
d    4
e    5
f    6
g    7
h    8
i    9
dtype: int64

TypeError: 'set' type is unordered

In [8]:
list1=[1,2,3,4,5,6,7,8,9,10]
tup1=(1,2,3,4,5,6,7,8,9,10)
set1={1,2,3,4,5,6,7,8,9,10}


# Pandas Series by using list
i=['first','second','third','fourth','fifth','sixth','seventh','eighth','ninth','tenth']
s1=pd.Series(list1,index=i)
print(s1)
s1

#for tuple
s2=pd.Series(tup1,index=i)
print(s2)
s2

#for set
s3=pd.Series(set1,index=i)
print(s3)
s3

first       1
second      2
third       3
fourth      4
fifth       5
sixth       6
seventh     7
eighth      8
ninth       9
tenth      10
dtype: int64
first       1
second      2
third       3
fourth      4
fifth       5
sixth       6
seventh     7
eighth      8
ninth       9
tenth      10
dtype: int64

TypeError: 'set' type is unordered

In [10]:
#set
set1={1,2,3,4,5,6,7,8,9,10}
s3=pd.Series(list(set1),index=['a','b','c','d','e','f','g','h','i','j'])
s3

a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
dtype: int64

In [11]:
#What if the index is too lengthy then do we have still count

data=[1,2,3,4,5,6,64,56,48,12,14,18,89,65]

list_for_index=[]
for i in range(1,len(data)+1):
  list_for_index.append(i)
ss=pd.Series(data,index=list_for_index)
ss

1      1
2      2
3      3
4      4
5      5
6      6
7     64
8     56
9     48
10    12
11    14
12    18
13    89
14    65
dtype: int64

# 1. Create a Python dictionary with three key values pairs.Keep keys as the first name and the respected name as values in the dictionary.

2.Use the dictionary to create a pandas series.

In [12]:
#Create a Python dictionary with three key values pairs.Keep keys as the first name and the respected name as values in the dictionary.

data= {'Archana' : 'satapathy' , 'Ram' : 'Narayanan' , 'abc' : 'xyz'}
s1= pd.Series(data)
s1
#

Archana    satapathy
Ram        Narayanan
abc              xyz
dtype: object

In [ ]:
# prompt: Create a Python dictionary with three key values pairs.Keep keys as the first name and the respected name as values in the dictionary

import pandas as pd

# Create a dictionary with first names as keys and full names as values
name_dict = {
    "Alice": "Alice Wonderland",
    "Bob": "Bob The Builder",
    "Charlie": "Charlie Chaplin"
}

# Create a pandas Series from the dictionary
names_series = pd.Series(name_dict)

# Print the series
names_series

In [14]:
#if you will use dictionary to create series ,keys of the dictionary will act as index, and values as data.

dict1={'Rahul': 'Singh' , 'Saif' : 'Khan' , 'Alex' : 'John'}

s5= pd.Series(dict1)
s5

Rahul    Singh
Saif      Khan
Alex      John
dtype: object

# Create a pandas series, with the elements as number from 1-10.Use the index values starting from 0-10.For the above series:
a. convert it to a list
b.convert it to a dictionary
c.convert it to a tuple
d.convert it to a set.

In [19]:
# prompt: Create a pandas series, with the elements as number from 1-10.Use the index values starting from 0-10.For the above series:

import pandas as pd

# Create a pandas Series with elements 1-10 and index 0-10
data = list(range(1, 11))
index_values = list(range(10))  # Index values 0-9
series = pd.Series(data, index=index_values)

# a. Convert the Series to a list
series_list = series.tolist()
print("Series as a list:", series_list)

# b. Convert the Series to a dictionary
series_dict = series.to_dict()
print("Series as a dictionary:", series_dict)

# c. Convert the Series to a tuple
series_tuple = tuple(series)
print("Series as a tuple:", series_tuple)

# d. Convert the Series to a set
series_set = set(series)
print("Series as a set:", series_set)

Series as a list: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
Series as a dictionary: {0: 1, 1: 2, 2: 3, 3: 4, 4: 5, 5: 6, 6: 7, 7: 8, 8: 9, 9: 10}
Series as a tuple: (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
Series as a set: {1, 2, 3, 4, 5, 6, 7, 8, 9, 10}

In [15]:
data=list (range(1,11))
index_values=list(range(10))
s1=pd.Series(data,index=index_values)
s1

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [20]:
# a. Convert the Series to a list

series_list = series.tolist()
print("Series as a list:", series_list)

Series as a list: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [21]:
# b. Convert the Series to a dictionary
series_dict = series.to_dict()
print("Series as a dictionary:", series_dict)

Series as a dictionary: {0: 1, 1: 2, 2: 3, 3: 4, 4: 5, 5: 6, 6: 7, 7: 8, 8: 9, 9: 10}

In [22]:
# c. Convert the Series to a tuple
series_tuple = tuple(series)
print("Series as a tuple:", series_tuple)

Series as a tuple: (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)

In [23]:
# d. Convert the Series to a set
series_set = set(series)
print("Series as a set:", series_set)

Series as a set: {1, 2, 3, 4, 5, 6, 7, 8, 9, 10}

In [25]:
s1=pd.Series([1,2,3,4,5,6,7,8,9,10])
s1

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [26]:
list1=list(s1)
list1

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [28]:
tup1=tuple(s1)
tup1

(1, 2, 3, 4, 5, 6, 7, 8, 9, 10)

In [29]:
set1= set(s1)
set1

{1, 2, 3, 4, 5, 6, 7, 8, 9, 10}

In [30]:
dic1=dict(s1)
dic1

{0: np.int64(1),
 1: np.int64(2),
 2: np.int64(3),
 3: np.int64(4),
 4: np.int64(5),
 5: np.int64(6),
 6: np.int64(7),
 7: np.int64(8),
 8: np.int64(9),
 9: np.int64(10)}

# 4.Create a sample panda series with x integer elements, perform the following  operations on the series:

a. print the first 5 elemets of the series
b. print the last 5 elements of the series
c. update the last elements in the series with value 100.
d. delete the first element from the series.

In [42]:
x=10
s1=pd.Series(range(2,x+1))
s1

0     2
1     3
2     4
3     5
4     6
5     7
6     8
7     9
8    10
dtype: int64

In [37]:
# prompt: Create a sample panda series with x integer elements, perform the following operations on the series

import pandas as pd

# Assuming 'x' is the number of elements you want in the series.
x = 10  # Replace with your desired number of elements
s1 = pd.Series(range(1, x + 1))


# a. Print the first 5 elements of the series
print("First 5 elements:\n", s1.head(5))

# b. Print the last 5 elements of the series
print("\nLast 5 elements:\n", s1.tail(5))

# c. Update the last element in the series with value 100
s1.iloc[-1] = 100  # Using iloc to modify by position
print("\nSeries after updating last element:\n", s1)

# d. Delete the first element from the series
s1 = s1.drop(s1.index[0]) # Using index to drop by label.
print("\nSeries after deleting the first element:\n", s1)

First 5 elements:
 0    1
1    2
2    3
3    4
4    5
dtype: int64

Last 5 elements:
 5     6
6     7
7     8
8     9
9    10
dtype: int64

Series after updating last element:
 0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9    100
dtype: int64

Series after deleting the first element:
 1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9    100
dtype: int64

In [56]:
# a. Print the first 5 elements of the series
# lets assume x as 10

import pandas as pd

# Assuming x = 10, and creating a series with 10 elements
s = pd.Series([11, 22, 33, 44, 55, 66, 77, 88, 99, 101])

# Print first 5 elements
print(s.head())

# Print last 5 elements
print(s.tail())

0    11
1    22
2    33
3    44
4    55
dtype: int64
5     66
6     77
7     88
8     99
9    101
dtype: int64

In [57]:
#update /replace the last elements in the series with th evalue 100.

s[9]

np.int64(101)

In [ ]:
# to delete th efirst element from the series .
#s= s.drop(0)
#s

In [58]:
s= s.drop(0)
s=s.reset_index(drop= True)
s

0     22
1     33
2     44
3     55
4     66
5     77
6     88
7     99
8    101
dtype: int64